import streamlit as st

#Οτι Tab Θα χρειαστουμε , tab1 = Ανεβασε το αρχειο σου , tab2 =  2D Visualization και τα λοιπααα!!
tab1 , tab2 , tab3 , tab4 ,tab5 = st.tabs(["Ανέβασε το αρχείο σου", "2D Visualization" , "Μηχανικής Μάθησης" ,"Αποτελέσματα και Σύγκριση" , "Information"])

st.sidebar.title("Εργασία Εξαμήνου")#ειναι το Sidebar 


with tab1:
    st.write("Εδώ μπορείτε να ανεβάσετε το αρχείο σας")
    uploaded_files = st.file_uploader("Choose a CSV file", accept_multiple_files=True)
with tab5:     #Το παρακατω κειμενακι θα αλλαξει λογικα οσο αναπτυσεται το app
    st.write("""
    ### Οδηγίες Χρήσης

    1. **Ανέβασε το αρχείο σου**:
        - Επιλέξτε το tab "Ανέβασε το αρχείο σου".
        - Κάντε κλικ στο κουμπί ή στην περιοχή "Choose a CSV file" για να επιλέξετε το αρχείο CSV που θέλετε να χρησιμοποιήσετε.
        - Μετά την επιλογή του αρχείου, παρακαλώ περιμένετε για τη φόρτωση των δεδομένων.
    ****
    2. **2D Visualization**:
        - Επιλέξτε το tab "2D Visualization".
        - Εδώ μπορείτε να προβάλετε οπτικοποιήσεις των δεδομένων σας σε διάφορες διαστάσεις.
    ****   
    3. **Μηχανικής Μάθησης**:
        - Επιλέξτε το tab "Μηχανικής Μάθησης".
        - Εδώ μπορείτε να εφαρμόσετε αλγόριθμους μηχανικής μάθησης στα δεδομένα σας.
    ****         
    4. **Αποτελέσματα και Σύγκριση**:
        - Επιλέξτε το tab "Αποτελέσματα και Σύγκριση".
        - Εδώ μπορείτε να δείτε τα αποτελέσματα της ανάλυσης σας και να συγκρίνετε διαφορετικές προσεγγίσεις.
    ****
    5. **Information**:
        - Επιλέξτε το tab "Information".
        - Εδώ θα βρείτε πληροφορίες σχετικά με την ομάδα που δημιούργησε την εφαρμογή ή άλλες γενικές πληροφορίες που θεωρείτε σημαντικές για τους χρήστες σας.
    """)

    st.write("""
    ****
    ### Πληροφορίες Ομάδας

    - Ευάγγελος Κωνσταντινίδης
    - Εμμανουήλ Μπιλιουρής
    - Φώτης Σταματόπουλος
    """)
